pub use crate::clBindings::clCommon::*;
pub use crate::clBindings::clRuleApi::*;
pub use crate::clBindings::clMemStats::*;
pub use crate::clBindings::clPoolIpi::*;
/* automatically generated by rust-bindgen 0.66.1 */

#[doc = " This is to set the read or write offset pointer to a position mentioned\n from the BEGINING of the Buffer message."]
pub const ClBufferSeekTypeT_CL_BUFFER_SEEK_SET: ClBufferSeekTypeT = 0;
#[doc = " This is to set the read or write offset pointer to a position mentioned\n from the CURRENT position of the pointer of the Buffer message."]
pub const ClBufferSeekTypeT_CL_BUFFER_SEEK_CUR: ClBufferSeekTypeT = 1;
#[doc = " This is to set the read or write offset pointer to a position mentioned\n from the END of the Buffer message."]
pub const ClBufferSeekTypeT_CL_BUFFER_SEEK_END: ClBufferSeekTypeT = 2;
#[doc = " This is to set the read or write offset pointer to a position mentioned\n from the END of the Buffer message."]
pub const ClBufferSeekTypeT_CL_BUFFER_SEEK_MAX: ClBufferSeekTypeT = 3;
pub type ClBufferSeekTypeT = ::std::os::raw::c_uint;
#[doc = " The type of the handle for the buffer messages."]
pub type ClBufferHandleT = ClPtrT;
#[doc = " In this mode the buffer library uses the malloc and free for allocating and\n deallocating memory for buffers."]
pub const ClBufferMode_CL_BUFFER_NATIVE_MODE: ClBufferMode = 0;
#[doc = " This mode makes buffer library uses Clovis implementation of Pool for\n allocating and deallocating memory for buffers."]
pub const ClBufferMode_CL_BUFFER_PREALLOCATED_MODE: ClBufferMode = 1;
#[doc = " This mode makes buffer library uses Clovis implementation of Pool for\n allocating and deallocating memory for buffers."]
pub const ClBufferMode_CL_BUFFER_MAX_MODE: ClBufferMode = 2;
#[doc = " The config mode of the Buffer. When configured in native mode,\n malloc is used for fetching the memory for the configured buffer pools\n instead of the clovis pool implementation."]
pub type ClBufferMode = ::std::os::raw::c_uint;
#[doc = " The config mode of the Buffer. When configured in native mode,\n malloc is used for fetching the memory for the configured buffer pools\n instead of the clovis pool implementation."]
pub use self::ClBufferMode as ClBufferModeT;
#[doc = " The type of the buffer configuration info."]
#[repr(C)]
pub struct ClBufferPoolConfigT {
    #[doc = " The Number pools used for buffer library."]
    pub numPools: ClUint32T,
    #[doc = " Pool configuration of all the pools used by buffer library."]
    pub pPoolConfig: *mut ClPoolConfigT,
    #[doc = " Mode of usage of pools"]
    pub lazy: ClBoolT,
    #[doc = " Mode configured for Buffer fof fetching the memory.\n i.e \\e CL_BUFFER_NATIVE_MODE, or \\e CL_BUFFER_PREALLOCATED_MODE."]
    pub mode: ClBufferModeT,
}
#[test]
fn bindgen_test_layout_ClBufferPoolConfigT() {
    const UNINIT: ::std::mem::MaybeUninit<ClBufferPoolConfigT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClBufferPoolConfigT>(),
        24usize,
        concat!("Size of: ", stringify!(ClBufferPoolConfigT))
    );
    assert_eq!(
        ::std::mem::align_of::<ClBufferPoolConfigT>(),
        8usize,
        concat!("Alignment of ", stringify!(ClBufferPoolConfigT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numPools) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClBufferPoolConfigT),
            "::",
            stringify!(numPools)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pPoolConfig) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ClBufferPoolConfigT),
            "::",
            stringify!(pPoolConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lazy) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ClBufferPoolConfigT),
            "::",
            stringify!(lazy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ClBufferPoolConfigT),
            "::",
            stringify!(mode)
        )
    );
}
extern "C" {
