pub use crate::clBindings::clCommon::*;
pub use crate::clBindings::clCommonErrors::*;
pub use crate::clBindings::clCntApi::*;
pub use crate::clBindings::clOsalApi::*;
pub use crate::clBindings::clEoApi::*;
pub use crate::clBindings::clTimerApi::*;
pub use crate::clBindings::clCksmApi::*;
pub use crate::clBindings::clIocApi::*;
pub use crate::clBindings::clRmdApi::*;
pub use crate::clBindings::clIocApiExt::*;
pub use crate::clBindings::clCpmConfigApi::*;
pub use crate::clBindings::clCpmErrors::*;
pub use crate::clBindings::clAmsTypes::*;
/* automatically generated by rust-bindgen 0.66.1 */

pub const CL_CPM_RELEASE_CODE: u8 = 66u8;
pub const CL_CPM_MAJOR_VERSION: u32 = 1;
pub const CL_CPM_MINOR_VERSION: u32 = 1;
pub const CL_CPM_EVENT_CHANNEL_NAME: &[u8; 18] = b"CPM_EVENT_CHANNEL\0";
pub const CL_CPM_NODE_EVENT_CHANNEL_NAME: &[u8; 23] = b"CPM_NODE_EVENT_CHANNEL\0";
pub const CL_CPM_IOC_SLOT_BITS: u32 = 16;
pub const CL_CPM_IOC_SLOT_BITS_HEX: u32 = 65535;
pub const CL_CPM_COMP_ARRIVAL_PATTERN: u32 = 1;
pub const CL_CPM_COMP_DEPART_PATTERN: u32 = 2;
pub const CL_CPM_COMP_DEATH_PATTERN: u32 = 4;
pub const CL_CPM_NODE_ARRIVAL_PATTERN: u32 = 8;
pub const CL_CPM_NODE_DEPART_PATTERN: u32 = 16;
pub const CL_CPM_NODE_DEATH_PATTERN: u32 = 32;
#[doc = " The type of the handle supplied by the CPM to the process which\n calls the clCpmClientInitialize() API. This indicates the\n association of the process with the CPM(AMF) client library."]
pub type ClCpmHandleT = ClHandleT;
#[doc = " Indicates a node's arrival."]
pub const ClCpmNodeEventT_CL_CPM_NODE_ARRIVAL: ClCpmNodeEventT = 0;
#[doc = " Indicates a node's graceful departure."]
pub const ClCpmNodeEventT_CL_CPM_NODE_DEPARTURE: ClCpmNodeEventT = 1;
#[doc = " Indicates a node's sudden/ungraceful departure."]
pub const ClCpmNodeEventT_CL_CPM_NODE_DEATH: ClCpmNodeEventT = 2;
#[doc = " Flags that can be used by subscriber to distinguish diffrent\n events related to node."]
pub type ClCpmNodeEventT = ::std::os::raw::c_uint;
#[doc = " Indicates that component is ready to provide service."]
pub const ClCpmCompEventT_CL_CPM_COMP_ARRIVAL: ClCpmCompEventT = 0;
#[doc = " Indicates that component was terminated gracefully."]
pub const ClCpmCompEventT_CL_CPM_COMP_DEPARTURE: ClCpmCompEventT = 1;
#[doc = " Indicates that component was terminated ungracefully,\n i.e. failure event."]
pub const ClCpmCompEventT_CL_CPM_COMP_DEATH: ClCpmCompEventT = 2;
#[doc = " Flags that can be used by subscriber to distinguish diffrent\n component events."]
pub type ClCpmCompEventT = ::std::os::raw::c_uint;
#[doc = " Payload data for the component death event published by the CPM."]
#[repr(C)]
pub struct ClCpmEventPayLoadT {
    #[doc = " Component which failed/lost heartbeat to the CPM."]
    pub compName: ClNameT,
    #[doc = " Node name containing the component."]
    pub nodeName: ClNameT,
    #[doc = " Component ID."]
    pub compId: ClUint32T,
    #[doc = " EO ID."]
    pub eoId: ClEoIdT,
    #[doc = " IOC address of the node containing the component.\n component is located."]
    pub nodeIocAddress: ClIocNodeAddressT,
    #[doc = "  IOC port of the node containing the component."]
    pub eoIocPort: ClIocPortT,
    #[doc = " Indication of whether component is:\n - Coming up\n - Going down gracefully (i.e. termination)\n - Gone down ungracefully (i.e. abnormal exit, crash etc)"]
    pub operation: ClCpmCompEventT,
}
#[test]
fn bindgen_test_layout_ClCpmEventPayLoadT() {
    const UNINIT: ::std::mem::MaybeUninit<ClCpmEventPayLoadT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClCpmEventPayLoadT>(),
        544usize,
        concat!("Size of: ", stringify!(ClCpmEventPayLoadT))
    );
    assert_eq!(
        ::std::mem::align_of::<ClCpmEventPayLoadT>(),
        8usize,
        concat!("Alignment of ", stringify!(ClCpmEventPayLoadT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).compName) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmEventPayLoadT),
            "::",
            stringify!(compName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nodeName) as usize - ptr as usize },
        258usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmEventPayLoadT),
            "::",
            stringify!(nodeName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).compId) as usize - ptr as usize },
        516usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmEventPayLoadT),
            "::",
            stringify!(compId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eoId) as usize - ptr as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmEventPayLoadT),
            "::",
            stringify!(eoId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nodeIocAddress) as usize - ptr as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmEventPayLoadT),
            "::",
            stringify!(nodeIocAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eoIocPort) as usize - ptr as usize },
        532usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmEventPayLoadT),
            "::",
            stringify!(eoIocPort)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).operation) as usize - ptr as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmEventPayLoadT),
            "::",
            stringify!(operation)
        )
    );
}
#[doc = " Payload data for the node arrival/departure event published by the\n CPM."]
#[repr(C)]
pub struct ClCpmEventNodePayLoadT {
    #[doc = " Name of the node for which this event is published."]
    pub nodeName: ClNameT,
    #[doc = " Node IOC Address, where this component is located."]
    pub nodeIocAddress: ClIocNodeAddressT,
    #[doc = " Indication for whether the node is starting up, i.e., \\c CL_CPM_NODE_ARRIVAL\n or shutting down gracefully, i.e., \\c CL_CPM_NODE_DEPARTURE or shutting down\n ungracefully, i.e., \\c CL_CPM_NODE_DEATH."]
    pub operation: ClCpmNodeEventT,
}
#[test]
fn bindgen_test_layout_ClCpmEventNodePayLoadT() {
    const UNINIT: ::std::mem::MaybeUninit<ClCpmEventNodePayLoadT> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClCpmEventNodePayLoadT>(),
        268usize,
        concat!("Size of: ", stringify!(ClCpmEventNodePayLoadT))
    );
    assert_eq!(
        ::std::mem::align_of::<ClCpmEventNodePayLoadT>(),
        4usize,
        concat!("Alignment of ", stringify!(ClCpmEventNodePayLoadT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nodeName) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmEventNodePayLoadT),
            "::",
            stringify!(nodeName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nodeIocAddress) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmEventNodePayLoadT),
            "::",
            stringify!(nodeIocAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).operation) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmEventNodePayLoadT),
            "::",
            stringify!(operation)
        )
    );
}
#[repr(C)]
pub struct ClCpmCompCSI {
    pub haState: ClAmsHAStateT,
    pub csiDescriptor: ClAmsCSIDescriptorT,
}
#[test]
fn bindgen_test_layout_ClCpmCompCSI() {
    const UNINIT: ::std::mem::MaybeUninit<ClCpmCompCSI> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClCpmCompCSI>(),
        552usize,
        concat!("Size of: ", stringify!(ClCpmCompCSI))
    );
    assert_eq!(
        ::std::mem::align_of::<ClCpmCompCSI>(),
        8usize,
        concat!("Alignment of ", stringify!(ClCpmCompCSI))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).haState) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmCompCSI),
            "::",
            stringify!(haState)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).csiDescriptor) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmCompCSI),
            "::",
            stringify!(csiDescriptor)
        )
    );
}
pub type ClCpmCompCSIT = ClCpmCompCSI;
#[repr(C)]
pub struct ClCpmCompCSIRef {
    pub numCSIs: ClUint32T,
    pub pCSIList: *mut ClCpmCompCSIT,
}
#[test]
fn bindgen_test_layout_ClCpmCompCSIRef() {
    const UNINIT: ::std::mem::MaybeUninit<ClCpmCompCSIRef> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClCpmCompCSIRef>(),
        16usize,
        concat!("Size of: ", stringify!(ClCpmCompCSIRef))
    );
    assert_eq!(
        ::std::mem::align_of::<ClCpmCompCSIRef>(),
        8usize,
        concat!("Alignment of ", stringify!(ClCpmCompCSIRef))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numCSIs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmCompCSIRef),
            "::",
            stringify!(numCSIs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pCSIList) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmCompCSIRef),
            "::",
            stringify!(pCSIList)
        )
    );
}
pub type ClCpmCompCSIRefT = ClCpmCompCSIRef;
#[doc = " Component specific data which is maintained by CPM."]
#[repr(C)]
pub struct ClCpmCompSpecInfo {
    #[doc = " Arguments of a component."]
    pub numArgs: ClUint32T,
    pub args: *mut *mut ClCharT,
    #[doc = " Healthcheck related information"]
    pub period: ClUint32T,
    pub maxDuration: ClUint32T,
    pub recovery: ClAmsLocalRecoveryT,
}
#[test]
fn bindgen_test_layout_ClCpmCompSpecInfo() {
    const UNINIT: ::std::mem::MaybeUninit<ClCpmCompSpecInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClCpmCompSpecInfo>(),
        32usize,
        concat!("Size of: ", stringify!(ClCpmCompSpecInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<ClCpmCompSpecInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(ClCpmCompSpecInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numArgs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmCompSpecInfo),
            "::",
            stringify!(numArgs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).args) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmCompSpecInfo),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).period) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmCompSpecInfo),
            "::",
            stringify!(period)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxDuration) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmCompSpecInfo),
            "::",
            stringify!(maxDuration)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recovery) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmCompSpecInfo),
            "::",
            stringify!(recovery)
        )
    );
}
#[doc = " Component specific data which is maintained by CPM."]
pub type ClCpmCompSpecInfoT = ClCpmCompSpecInfo;
#[doc = " \\brief Component Manager requests the component, identified by \\e\n compName, to execute healthcheck using \\e healthcheckkey\n [Asynchronous Call].\n\n \\param invocation Particular invocation of this callback function.\n\n \\param pCompName Pointer to the name of the component that must\n undergo healthcheck.\n\n \\param pHealthCheckKey Key to fetch the healthcheck related\n attributes.\n"]
pub type ClCpmHealthCheckCallbackT = ::std::option::Option<
    unsafe extern "C" fn(
        invocation: ClInvocationT,
        pCompName: *const ClNameT,
        pHealthCheckKey: *mut ClAmsCompHealthcheckKeyT,
    ) -> ClRcT,
>;
#[doc = " \\brief Component Manager requests the component, identified by \\e\n compName, to gracefully shutdown [Asynchronous Call with reply].\n\n \\param invocation Particular invocation of this callback function.\n\n \\param pCompName Pointer to the name of the component that must\n gracefully terminate.\n"]
pub type ClCpmTerminateCallbackT = ::std::option::Option<
    unsafe extern "C" fn(invocation: ClInvocationT, pCompName: *const ClNameT) -> ClRcT,
>;
#[doc = " \\brief Component Manager requests the component, identified by \\e\n compName, to assume a particular HA state, specified by \\e haState,\n for one or all the CSIs [Asynchronous Call].\n\n \\param invocation Particular invocation of this callback function.\n\n \\param pCompName Pointer to the name of the component to which a\n CSI needs to be assigned.\n\n \\param haState HA-state to be assigned for CSI identified by \\e\n csiDescriptor, or for all CSIs, already supported by component [if\n \\c CSI_TARGET_ALL is set in \\e csiFlags of \\e csiDescriptor].\n\n \\param csiDescriptor Information about the CSI.\n\n \\sa ClCpmCSIRmvCallbackT"]
pub type ClCpmCSISetCallbackT = ::std::option::Option<
    unsafe extern "C" fn(
        invocation: ClInvocationT,
        pCompName: *const ClNameT,
        haState: ClAmsHAStateT,
        csiDescriptor: ClAmsCSIDescriptorT,
    ) -> ClRcT,
>;
#[doc = " \\brief Removes one or all the assigned CSIs.  Component Manager\n requests the component, identified by \\e compName, to remove a\n particular CSI or all the CSIs [Asynchronous Call].\n\n \\param invocation Particular invocation of this callback function.\n\n \\param pCompName Pointer to the name of the component to which a\n CSI needs to be assigned.\n\n \\param pCsiName Pointer to the \\e csiName that must be removed from\n component identified by \\e compName.\n\n \\param csiFlags Flags, which specify whether one or more CSI are\n affected.\n\n \\sa ClCpmCSISetCallbackT"]
pub type ClCpmCSIRmvCallbackT = ::std::option::Option<
    unsafe extern "C" fn(
        invocation: ClInvocationT,
        pCompName: *const ClNameT,
        pCsiName: *const ClNameT,
        csiFlags: ClAmsCSIFlagsT,
    ) -> ClRcT,
>;
#[doc = " \\brief Requested information gets delivered to \\e\n notificationBuffer. Type of information returned in this buffer\n depends on the \\e trackFlag parameter of the \\e\n clAMSProtectionGroupTrack function [Asynchronous Call]\n\n \\param pCsiName Pointer to the \\e csiName that must be removed from\n component identified by \\e compName.\n\n \\param pNotificationBuffer Pointer to a notification buffer, which\n contains the requested information.\n\n \\param numberOfMembers Number of components that belongs to\n protection group associated with the CSI, designated by \\e csiName.\n\n \\param error Indication whether Component Manager was able to\n perform the operation.\n"]
pub type ClCpmProtectionGroupTrackCallbackT = ::std::option::Option<
    unsafe extern "C" fn(
        pCsiName: *const ClNameT,
        pNotificationBuffer: *mut ClAmsPGNotificationBufferT,
        numberOfMembers: ClUint32T,
        error: ClUint32T,
    ),
>;
#[doc = " \\brief Component Manager requests the proxy component to\n instantiate the component, identified by \\e proxiedCompName\n [Asynchronous Call].\n\n \\param invocation Particular invocation of this callback function.\n\n \\param pProxiedCompName Pointer to the name of the component which\n needs to be instantiated.\n\n \\sa ClCpmProxiedComponentCleanupCallbackT"]
pub type ClCpmProxiedComponentInstantiateCallbackT = ::std::option::Option<
    unsafe extern "C" fn(invocation: ClInvocationT, pProxiedCompName: *const ClNameT) -> ClRcT,
>;
#[doc = " \\brief Component Manager requests the proxy component to cleanup\n the component, identified by \\e proxiedCompName [Asynchronous\n call].\n\n \\param invocation Particular invocation of this callback function.\n\n \\param pProxiedCompName Pointer to the name of the component to\n which needs to be cleaned up.\n\n \\sa ClCpmProxiedComponentInstantiateCallbackT"]
pub type ClCpmProxiedComponentCleanupCallbackT = ::std::option::Option<
    unsafe extern "C" fn(invocation: ClInvocationT, pProxiedCompName: *const ClNameT) -> ClRcT,
>;
#[doc = " \\brief This is the type of the callback fuction, which will be\n called when an node/component arrival/departure event occurs.\n\n \\param event Type of the event indicating whether it is node arrival/departure\n or component arrival/departure.\n\n \\param pArg Argument to the callback fuction.\n\n \\param pAddress Address of the node/component where the \\e event occurred.\n"]
pub type ClCpmNotificationFuncT = ::std::option::Option<
    unsafe extern "C" fn(event: ClIocNotificationIdT, pArg: ClPtrT, pAddress: *mut ClIocAddressT),
>;
#[doc = " The structure ClCpmCallbacksT contains the various callback\n functions that the Component Manager can invoke on a component."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ClCpmCallbacksT {
    #[doc = " Callback for checking the health of the component."]
    pub appHealthCheck: ClCpmHealthCheckCallbackT,
    #[doc = " Callback for gracefully shutting down the component."]
    pub appTerminate: ClCpmTerminateCallbackT,
    #[doc = " Callback for assigning the component service instance to the\n component."]
    pub appCSISet: ClCpmCSISetCallbackT,
    #[doc = " Callback for removing the component service instance assigned\n to the component."]
    pub appCSIRmv: ClCpmCSIRmvCallbackT,
    #[doc = " Callback invoked when the component registers for tracking\n changes in protection group and protection group configuration\n changes."]
    pub appProtectionGroupTrack: ClCpmProtectionGroupTrackCallbackT,
    #[doc = " Callback for instantiating a proxied component."]
    pub appProxiedComponentInstantiate: ClCpmProxiedComponentInstantiateCallbackT,
    #[doc = " Callback for cleaning up a proxied component."]
    pub appProxiedComponentCleanup: ClCpmProxiedComponentCleanupCallbackT,
}
#[test]
fn bindgen_test_layout_ClCpmCallbacksT() {
    const UNINIT: ::std::mem::MaybeUninit<ClCpmCallbacksT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClCpmCallbacksT>(),
        56usize,
        concat!("Size of: ", stringify!(ClCpmCallbacksT))
    );
    assert_eq!(
        ::std::mem::align_of::<ClCpmCallbacksT>(),
        8usize,
        concat!("Alignment of ", stringify!(ClCpmCallbacksT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).appHealthCheck) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmCallbacksT),
            "::",
            stringify!(appHealthCheck)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).appTerminate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmCallbacksT),
            "::",
            stringify!(appTerminate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).appCSISet) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmCallbacksT),
            "::",
            stringify!(appCSISet)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).appCSIRmv) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmCallbacksT),
            "::",
            stringify!(appCSIRmv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).appProtectionGroupTrack) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmCallbacksT),
            "::",
            stringify!(appProtectionGroupTrack)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).appProxiedComponentInstantiate) as usize - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmCallbacksT),
            "::",
            stringify!(appProxiedComponentInstantiate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).appProxiedComponentCleanup) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ClCpmCallbacksT),
            "::",
            stringify!(appProxiedComponentCleanup)
        )
    );
}
extern "C" {
