pub use crate::clBindings::clTimerApi::*;
pub use crate::clBindings::clCommon::*;
pub use crate::clBindings::clDbg::*;
pub use crate::clBindings::clLogUtilApi::*;
pub use crate::clBindings::clLogIpiWrap::*;
/* automatically generated by rust-bindgen 0.66.1 */

pub const CL_LOG_STREAM_NAME_MAX_LENGTH: u32 = 128;
pub const CL_LOG_SLINE_MSG_LEN: u32 = 256;
pub const CL_LOG_STREAM_CREATE: u32 = 1;
pub const CL_LOG_HANDLER_WILL_ACK: u32 = 1;
pub const CL_LOG_FILTER_ASSIGN: u32 = 1;
pub const CL_LOG_FILTER_MERGE_ADD: u32 = 2;
pub const CL_LOG_FILTER_MERGE_DELETE: u32 = 3;
pub const CL_LOG_MSGID_BUFFER: u32 = 0;
pub const CL_LOG_MSGID_PRINTF_FMT: u32 = 1;
pub const CL_LOG_TAG_TERMINATE: u32 = 0;
pub const CL_LOG_TAG_BASIC_SIGNED: u32 = 1;
pub const CL_LOG_TAG_BASIC_UNSIGNED: u32 = 2;
pub const CL_LOG_TAG_STRING: u32 = 3;
pub const CL_LOG_PRNT_FMT_STR: &[u8; 36] = b"%-26s [%s:%d] (%.*s.%d : %s.%3s.%3s\0";
pub const CL_LOG_PRNT_FMT_STR_CONSOLE: &[u8; 49] =
    b"%-26s [%s:%d] (%.*s.%d : %s.%3s.%3s.%05d : %6s) \0";
pub const CL_LOG_PRNT_FMT_STR_WO_FILE: &[u8; 28] = b"%-26s (%.*s.%d : %s.%3s.%3s\0";
pub const CL_LOG_PRNT_FMT_STR_WO_FILE_CONSOLE: &[u8; 41] =
    b"%-26s (%.*s.%d : %s.%3s.%3s.%05d : %6s) \0";
#[doc = " The type of handle supplied by Log Service during initialization."]
pub type ClLogHandleT = ClHandleT;
#[doc = " The type of handle supplied by Log Service during log streamOpen and\n a process register itself as stream handler for the stream."]

pub const ClLogStreamScopeT_CL_LOG_STREAM_LOCAL: ClLogStreamScopeT = 1;
#[doc = " This enumeration is used to specify the scope of the stream.\n A stream can be local to the node(Local log stream) or global\n to the cluster(Global log stream)."]
pub type ClLogStreamScopeT = ::std::os::raw::c_uint;
#[doc = " It directs the Log Service to create a new Log File Unit when the current\n Log File Unit becomes full. The number of maximum Log File Units that can\n simultaneously exist is limited by maxFilesRotated attribute of the Log Stream.\n Once this limit is reached, the oldest Log File Unit is deleted and a new one is\n created."]
pub const ClLogFileFullActionT_CL_LOG_FILE_FULL_ACTION_ROTATE: ClLogFileFullActionT = 0;
#[doc = " It makes the Log Service treat the Log File as a circular buffer, i.e., when the Log\n File becomes full, Log Service starts overwriting oldest records."]
pub const ClLogFileFullActionT_CL_LOG_FILE_FULL_ACTION_WRAP: ClLogFileFullActionT = 1;
#[doc = " Log Service stops putting more records in the Log File once it becomes full."]
pub const ClLogFileFullActionT_CL_LOG_FILE_FULL_ACTION_HALT: ClLogFileFullActionT = 2;
#[doc = " This enumeration is used to specify the behavior of Log Service once the Log\n File into which this Log Stream is going becomes full."]
pub type ClLogFileFullActionT = ::std::os::raw::c_uint;
#[doc = " This structure describes the attributes of the stream."]
#[repr(C)]
pub struct ClLogStreamAttributesT {
    #[doc = " Its the prefix name of file units that are going to be created."]
    pub fileName: *mut ClCharT,
    #[doc = " Its the path where the log file unit(s) will be created."]
    pub fileLocation: *mut ClCharT,
    #[doc = " Size of the file unit. It will be truncated to multiples of recordSize."]
    pub fileUnitSize: ClUint32T,
    #[doc = " Size of the log record."]
    pub recordSize: ClUint32T,
    #[doc = " Log file replication property. Currently is not supported."]
    pub haProperty: ClBoolT,
    #[doc = " Action that log service has to take, when the log file unit becomes full."]
    pub fileFullAction: ClLogFileFullActionT,
    #[doc = " If fileAction is CL_LOG_FILE_FULL_ACTION_ROTATE, the maximum num of log\n file units that will be created by logService.Otherwise ignored."]
    pub maxFilesRotated: ClUint32T,
    #[doc = " Num of log records after which the log stream records must be flushed."]
    pub flushFreq: ClUint32T,
    #[doc = " Time after which the log stream records must be flushed."]
    pub flushInterval: ClTimeT,
    #[doc = " The water mark for file units.When the size of file reaches this level,\n the water mark event will be published."]
    pub waterMark: ClWaterMarkT,
    pub syslog: ClBoolT,
}
#[test]
fn bindgen_test_layout_ClLogStreamAttributesT() {
    const UNINIT: ::std::mem::MaybeUninit<ClLogStreamAttributesT> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClLogStreamAttributesT>(),
        72usize,
        concat!("Size of: ", stringify!(ClLogStreamAttributesT))
    );
    assert_eq!(
        ::std::mem::align_of::<ClLogStreamAttributesT>(),
        8usize,
        concat!("Alignment of ", stringify!(ClLogStreamAttributesT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fileName) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamAttributesT),
            "::",
            stringify!(fileName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fileLocation) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamAttributesT),
            "::",
            stringify!(fileLocation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fileUnitSize) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamAttributesT),
            "::",
            stringify!(fileUnitSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recordSize) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamAttributesT),
            "::",
            stringify!(recordSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).haProperty) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamAttributesT),
            "::",
            stringify!(haProperty)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fileFullAction) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamAttributesT),
            "::",
            stringify!(fileFullAction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxFilesRotated) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamAttributesT),
            "::",
            stringify!(maxFilesRotated)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flushFreq) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamAttributesT),
            "::",
            stringify!(flushFreq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flushInterval) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamAttributesT),
            "::",
            stringify!(flushInterval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).waterMark) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamAttributesT),
            "::",
            stringify!(waterMark)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).syslog) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamAttributesT),
            "::",
            stringify!(syslog)
        )
    );
}
#[doc = " This flags to specify the stream should be created or opened."]
pub type ClLogStreamOpenFlagsT = ClUint8T;
#[doc = " This structure describes all the information about the log stream."]
#[repr(C)]
pub struct ClLogStreamInfoT {
    #[doc = " Name of the log stream."]
    pub streamName: ClNameT,
    #[doc = " Scope of the log stream."]
    pub streamScope: ClLogStreamScopeT,
    #[doc = " The name of the node on which the stream exist."]
    pub streamScopeNode: ClNameT,
    #[doc = " The unique id for the stream in the cluster."]
    pub streamId: ClUint16T,
    #[doc = " Attributes of the log stream."]
    pub streamAttr: ClLogStreamAttributesT,
}
#[test]
fn bindgen_test_layout_ClLogStreamInfoT() {
    const UNINIT: ::std::mem::MaybeUninit<ClLogStreamInfoT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClLogStreamInfoT>(),
        600usize,
        concat!("Size of: ", stringify!(ClLogStreamInfoT))
    );
    assert_eq!(
        ::std::mem::align_of::<ClLogStreamInfoT>(),
        8usize,
        concat!("Alignment of ", stringify!(ClLogStreamInfoT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).streamName) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamInfoT),
            "::",
            stringify!(streamName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).streamScope) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamInfoT),
            "::",
            stringify!(streamScope)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).streamScopeNode) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamInfoT),
            "::",
            stringify!(streamScopeNode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).streamId) as usize - ptr as usize },
        522usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamInfoT),
            "::",
            stringify!(streamId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).streamAttr) as usize - ptr as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamInfoT),
            "::",
            stringify!(streamAttr)
        )
    );
}
#[doc = " This structure describes the information about the log stream to\n stream Id mapping."]
#[repr(C)]
pub struct ClLogStreamMapT {
    #[doc = " Name of the log stream."]
    pub streamName: ClNameT,
    #[doc = " Scope of the log stream."]
    pub streamScope: ClLogStreamScopeT,
    #[doc = " Node name on which the stream exist."]
    pub nodeName: ClNameT,
    #[doc = " Unique id of the stream in the cluster."]
    pub streamId: ClUint16T,
}
#[test]
fn bindgen_test_layout_ClLogStreamMapT() {
    const UNINIT: ::std::mem::MaybeUninit<ClLogStreamMapT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClLogStreamMapT>(),
        524usize,
        concat!("Size of: ", stringify!(ClLogStreamMapT))
    );
    assert_eq!(
        ::std::mem::align_of::<ClLogStreamMapT>(),
        4usize,
        concat!("Alignment of ", stringify!(ClLogStreamMapT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).streamName) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamMapT),
            "::",
            stringify!(streamName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).streamScope) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamMapT),
            "::",
            stringify!(streamScope)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nodeName) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamMapT),
            "::",
            stringify!(nodeName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).streamId) as usize - ptr as usize },
        522usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogStreamMapT),
            "::",
            stringify!(streamId)
        )
    );
}
#[doc = " While registering as strean handler, the process should specify\n this flag."]
pub type ClLogStreamHandlerFlagsT = ClUint8T;
#[doc = " setting severity as EMERGENCY."]
pub const ClLogSeverityT_CL_LOG_SEV_EMERGENCY: ClLogSeverityT = 1;
#[doc = " setting severity as ALERT."]
pub const ClLogSeverityT_CL_LOG_SEV_ALERT: ClLogSeverityT = 2;
#[doc = " setting severity as CRITICAL."]
pub const ClLogSeverityT_CL_LOG_SEV_CRITICAL: ClLogSeverityT = 3;
#[doc = " setting severity as ERROR."]
pub const ClLogSeverityT_CL_LOG_SEV_ERROR: ClLogSeverityT = 4;
#[doc = " setting severity as WARNING."]
pub const ClLogSeverityT_CL_LOG_SEV_WARNING: ClLogSeverityT = 5;
#[doc = " setting severity as NOTICE."]
pub const ClLogSeverityT_CL_LOG_SEV_NOTICE: ClLogSeverityT = 6;
#[doc = " setting severity as INFORMATION."]
pub const ClLogSeverityT_CL_LOG_SEV_INFO: ClLogSeverityT = 7;
#[doc = " setting severity as DEBUG."]
pub const ClLogSeverityT_CL_LOG_SEV_DEBUG: ClLogSeverityT = 8;
#[doc = " setting severity as DEBUG."]
pub const ClLogSeverityT_CL_LOG_SEV_DEBUG1: ClLogSeverityT = 8;
#[doc = " setting severity as DEBUG."]
pub const ClLogSeverityT_CL_LOG_SEV_DEBUG2: ClLogSeverityT = 9;
#[doc = " setting severity as DEBUG."]
pub const ClLogSeverityT_CL_LOG_SEV_DEBUG3: ClLogSeverityT = 10;
#[doc = " setting severity as DEBUG."]
pub const ClLogSeverityT_CL_LOG_SEV_DEBUG4: ClLogSeverityT = 11;
#[doc = " setting severity as DEBUG."]
pub const ClLogSeverityT_CL_LOG_SEV_DEBUG5: ClLogSeverityT = 12;
#[doc = " setting severity as DEBUG."]
pub const ClLogSeverityT_CL_LOG_SEV_TRACE: ClLogSeverityT = 12;
#[doc = " setting severity as DEBUG."]
pub const ClLogSeverityT_CL_LOG_SEV_DEBUG6: ClLogSeverityT = 13;
#[doc = " setting severity as DEBUG."]
pub const ClLogSeverityT_CL_LOG_SEV_DEBUG7: ClLogSeverityT = 14;
#[doc = " setting severity as DEBUG."]
pub const ClLogSeverityT_CL_LOG_SEV_DEBUG8: ClLogSeverityT = 15;
#[doc = " setting severity as DEBUG."]
pub const ClLogSeverityT_CL_LOG_SEV_DEBUG9: ClLogSeverityT = 16;
#[doc = " Maximum severity level."]
pub const ClLogSeverityT_CL_LOG_SEV_MAX: ClLogSeverityT = 16;
pub type ClLogSeverityT = ::std::os::raw::c_uint;
#[doc = " Variables of this type is used as a bitmap. Values from\n ClLogSeverityT are used to set the individual bits in the\n bitmap."]
pub type ClLogSeverityFilterT = ClUint16T;
#[doc = " It takes the values of above specifed flags."]
pub type ClLogFilterFlagsT = ClUint8T;
#[doc = " This structure describes the filter settings for the stream."]
#[repr(C)]
pub struct ClLogFilterT {
    #[doc = " This field identifies the severity level."]
    pub severityFilter: ClLogSeverityFilterT,
    #[doc = " The size of the memory pointed by pMsgIdSet in bytes."]
    pub msgIdSetLength: ClUint16T,
    #[doc = " This memory will be treated as bitmap to mask the message ids"]
    pub pMsgIdSet: *mut ClUint8T,
    #[doc = " The size of the memory pointed by pCompIdSet in bytes."]
    pub compIdSetLength: ClUint16T,
    #[doc = " This memory will be treated as bitmap to mask the component ids"]
    pub pCompIdSet: *mut ClUint8T,
}
#[test]
fn bindgen_test_layout_ClLogFilterT() {
    const UNINIT: ::std::mem::MaybeUninit<ClLogFilterT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClLogFilterT>(),
        32usize,
        concat!("Size of: ", stringify!(ClLogFilterT))
    );
    assert_eq!(
        ::std::mem::align_of::<ClLogFilterT>(),
        8usize,
        concat!("Alignment of ", stringify!(ClLogFilterT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).severityFilter) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogFilterT),
            "::",
            stringify!(severityFilter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msgIdSetLength) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogFilterT),
            "::",
            stringify!(msgIdSetLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pMsgIdSet) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogFilterT),
            "::",
            stringify!(pMsgIdSet)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).compIdSetLength) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogFilterT),
            "::",
            stringify!(compIdSetLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pCompIdSet) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogFilterT),
            "::",
            stringify!(pCompIdSet)
        )
    );
}
#[doc = "  \\brief This function gets called When clLogStreamOpenAsync() call\n   returns on the server.\n\n  \\par Header File:\n  clLogApi.h\n\n  \\param invocation (in) invocation value of the call. This is basically an\n  identification about the call.\n\n  \\param hStream (in) contains handle of the opened stream, if the\n  clLogStreamOpenAsync() was succesfull.\n\n  \\param rc (in) return value of the clLogStreamOpenAsync() call.\n\n  \\retval  CL_OK The Log stream is opened successfully.\n\n  \\retval  CL_ERR_NOT_EXIST \\c CL_LOG_STREAM_CREATE flag is not set in streamOpenFlags and\n  the Stream does not exist.\n\n  \\retval CL_ERR_ALREADY_EXIST \\c CL_LOG_STREAM_CREATE flag is set in streamOpenFlags but\n  the Stream already exists and was originally created with different\n  attributes than specified by pStreamAttributes.\n\n  \\retval  CL_ERR_TIMEOUT An implementation defined timeout occurred before the call\n  could complete.\n\n  \\retval  CL_ERR_TRY_AGAIN The service could not be provided at this time.\n  The process may try later.\n\n  \\retval  CL_ERR_NO_MEMORY Either the Log Service library or some other module of\n  Log Service is out of memory. Thus service can not be provided at this time. This\n  may be a transient problem.\n\n  \\retval  CL_ERR_NO_RESOURCE Either the Log Service library or some other module\n  of Log Service is out of resources (other than memory). Thus, service can not be\n  provided at this time. This may be a transient problem.\n\n  \\par Description:\n  This streamOpen callback function is getting called, when\n  clLogStreamOpenAsync() call returns from the server. It carries the\n  invocation to identify the call and return code for indicating the status\n  of the call. If the retcode is CL_OK, then hStream will be carrying\n  the proper handle of the stream which was opened on the particular\n  invocation.\n\n  \\par Library File:\n  ClLogClient\n\n  \\sa clLogOpenStreamAsync()\n"]
pub type ClLogStreamOpenCallbackT = ::std::option::Option<
    unsafe extern "C" fn(invocation: ClInvocationT, hStream: ClLogStreamHandleT, rc: ClRcT),
>;
#[doc = "  \\brief Informs the logger about a change in filter settings of a Log\n  stream opened by this logger.\n\n  \\par Header File:\n  clLogApi.h\n\n  \\param hStream (in) contains handle of the stream for which the filter\n  settings have been updated.\n\n  \\param filter (in) New filter settings of the stream.\n\n  \\retval  none\n\n  \\par Description:\n  The Log Service invokes this function when the filter associated with a Log\n  Stream identified by hStream is changed either by a Logger or north-bound\n  interface. The Log Stream must be currently opened by this Logger. If either\n  pLogCallbacks parameter to clLogInitialize call was NULL or\n  clLogFilterSetCallback of that parameter was NULL, the Logger will not be\n  informed about change in filter settings.\n\n  \\par Library File:\n  ClLogClient\n\n  \\sa clLogFilterSet()\n"]
pub type ClLogFilterSetCallbackT =
    ::std::option::Option<unsafe extern "C" fn(hStream: ClLogStreamHandleT, filter: ClLogFilterT)>;
#[doc = "  \\brief Callback function to receive log records of Log streams of\n  interest.\n\n  \\par Header File:\n  clLogApi.h\n\n  \\param hStream (in) Handle obtained through a previous invocation to\n  clLogHandlerRegister(). This handle identifies the registration of handler\n  for a stream for which the Log Records are being delivered.\n\n  \\param sequenceNumber (in): A monotonically increasing no to detect the duplicate\n  delivery of a set of Log Records. It includes the node identifier and the\n  starting sequence number of the records.\n\n  \\param numRecords (in): Number of records in the buffer pointer by logRecords.\n\n  \\param pRecords (in): Pointer to a buffer that contains numRecords number of Log\n   Records from a stream identified by hStream.\n\n  \\param filter (in) New filter settings of the stream.\n\n  \\retval  none\n\n  \\par Description:\n   This callback delivers a set of new Log Records to the handlers. These\n   records will no more be available in the Log Stream.\n   This callback may be invoked multiple times for the same set of records,\n   which can be detected by the same sequenceNumber.\n   Memory for pRecords is allocated by the Log Service and must be freed by the\n   Handler.\n\n  \\par Library File:\n   ClLogClient\n\n  \\sa clLogFilterSet()\n"]
pub type ClLogRecordDeliveryCallbackT = ::std::option::Option<
    unsafe extern "C" fn(
        hStream: ClLogStreamHandleT,
        seqNum: ClUint64T,
        numRecords: ClUint32T,
        pRecords: ClPtrT,
    ),
>;
#[doc = " This structure describes about the callbacks which can be provided by\n process while initializing with Log Service."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ClLogCallbacksT {
    #[doc = " Callback for stream open."]
    pub clLogStreamOpenCb: ClLogStreamOpenCallbackT,
    #[doc = " Callback for informing filter settings updation."]
    pub clLogFilterSetCb: ClLogFilterSetCallbackT,
    #[doc = " Callback for delivering records to stream handlers."]
    pub clLogRecordDeliveryCb: ClLogRecordDeliveryCallbackT,
}
#[test]
fn bindgen_test_layout_ClLogCallbacksT() {
    const UNINIT: ::std::mem::MaybeUninit<ClLogCallbacksT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClLogCallbacksT>(),
        24usize,
        concat!("Size of: ", stringify!(ClLogCallbacksT))
    );
    assert_eq!(
        ::std::mem::align_of::<ClLogCallbacksT>(),
        8usize,
        concat!("Alignment of ", stringify!(ClLogCallbacksT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clLogStreamOpenCb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogCallbacksT),
            "::",
            stringify!(clLogStreamOpenCb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clLogFilterSetCb) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogCallbacksT),
            "::",
            stringify!(clLogFilterSetCb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clLogRecordDeliveryCb) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ClLogCallbacksT),
            "::",
            stringify!(clLogRecordDeliveryCb)
        )
    );
}
extern "C" {
