pub use crate::clBindings::clCommon::*;
pub use crate::clBindings::clTimerApi::*;
pub use crate::clBindings::clHeapApi::*;
pub use crate::clBindings::clArchHeaders::*;
/* automatically generated by rust-bindgen 0.66.1 */

#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::std::mem::transmute(self)
    }
}
impl<T> ::std::default::Default for __BindgenUnionField<T> {
    #[inline]
    fn default() -> Self {
        Self::new()
    }
}
impl<T> ::std::clone::Clone for __BindgenUnionField<T> {
    #[inline]
    fn clone(&self) -> Self {
        Self::new()
    }
}
impl<T> ::std::marker::Copy for __BindgenUnionField<T> {}
impl<T> ::std::fmt::Debug for __BindgenUnionField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__BindgenUnionField")
    }
}
impl<T> ::std::hash::Hash for __BindgenUnionField<T> {
    fn hash<H: ::std::hash::Hasher>(&self, _state: &mut H) {}
}
impl<T> ::std::cmp::PartialEq for __BindgenUnionField<T> {
    fn eq(&self, _other: &__BindgenUnionField<T>) -> bool {
        true
    }
}
impl<T> ::std::cmp::Eq for __BindgenUnionField<T> {}
pub const CL_OSAL_MIN_STACK_SIZE: u32 = 196608;
pub const CL_OSAL_NAME_MAX: u32 = 32;
pub const CL_OSAL_SHM_EXCEPTION_LENGTH: u32 = 2048;
pub const ClOsalSharedMutexFlags_CL_OSAL_SHARED_INVALID: ClOsalSharedMutexFlags = 0;
pub const ClOsalSharedMutexFlags_CL_OSAL_SHARED_NORMAL: ClOsalSharedMutexFlags = 1;
pub const ClOsalSharedMutexFlags_CL_OSAL_SHARED_SYSV_SEM: ClOsalSharedMutexFlags = 2;
pub const ClOsalSharedMutexFlags_CL_OSAL_SHARED_POSIX_SEM: ClOsalSharedMutexFlags = 4;
pub const ClOsalSharedMutexFlags_CL_OSAL_SHARED_RECURSIVE: ClOsalSharedMutexFlags = 8;
pub const ClOsalSharedMutexFlags_CL_OSAL_SHARED_PROCESS: ClOsalSharedMutexFlags = 16;
pub const ClOsalSharedMutexFlags_CL_OSAL_SHARED_ERROR_CHECK: ClOsalSharedMutexFlags = 32;
#[doc = "  The mutex type to be initialized"]
pub type ClOsalSharedMutexFlags = ::std::os::raw::c_uint;
#[doc = "  The mutex type to be initialized"]
pub use self::ClOsalSharedMutexFlags as ClOsalSharedMutexFlagsT;
#[repr(C)]
pub struct ClOsalMutex {
    pub flags: ClOsalSharedMutexFlagsT,
    pub shared_lock: ClOsalMutex_shared_lock,
}
#[repr(C)]
pub struct ClOsalMutex_shared_lock {
    pub mutex: __BindgenUnionField<pthread_mutex_t>,
    pub sem: __BindgenUnionField<ClOsalMutex_shared_lock_ClSem>,
    pub bindgen_union_field: [u64; 5usize],
}
#[repr(C)]
pub struct ClOsalMutex_shared_lock_ClSem {
    pub posSem: sem_t,
    pub semId: ::std::os::raw::c_int,
    pub numSems: ClInt32T,
}
#[test]
fn bindgen_test_layout_ClOsalMutex_shared_lock_ClSem() {
    const UNINIT: ::std::mem::MaybeUninit<ClOsalMutex_shared_lock_ClSem> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClOsalMutex_shared_lock_ClSem>(),
        40usize,
        concat!("Size of: ", stringify!(ClOsalMutex_shared_lock_ClSem))
    );
    assert_eq!(
        ::std::mem::align_of::<ClOsalMutex_shared_lock_ClSem>(),
        8usize,
        concat!("Alignment of ", stringify!(ClOsalMutex_shared_lock_ClSem))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).posSem) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClOsalMutex_shared_lock_ClSem),
            "::",
            stringify!(posSem)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).semId) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ClOsalMutex_shared_lock_ClSem),
            "::",
            stringify!(semId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numSems) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ClOsalMutex_shared_lock_ClSem),
            "::",
            stringify!(numSems)
        )
    );
}
#[test]
fn bindgen_test_layout_ClOsalMutex_shared_lock() {
    const UNINIT: ::std::mem::MaybeUninit<ClOsalMutex_shared_lock> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClOsalMutex_shared_lock>(),
        40usize,
        concat!("Size of: ", stringify!(ClOsalMutex_shared_lock))
    );
    assert_eq!(
        ::std::mem::align_of::<ClOsalMutex_shared_lock>(),
        8usize,
        concat!("Alignment of ", stringify!(ClOsalMutex_shared_lock))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mutex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClOsalMutex_shared_lock),
            "::",
            stringify!(mutex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sem) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClOsalMutex_shared_lock),
            "::",
            stringify!(sem)
        )
    );
}
#[test]
fn bindgen_test_layout_ClOsalMutex() {
    const UNINIT: ::std::mem::MaybeUninit<ClOsalMutex> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClOsalMutex>(),
        48usize,
        concat!("Size of: ", stringify!(ClOsalMutex))
    );
    assert_eq!(
        ::std::mem::align_of::<ClOsalMutex>(),
        8usize,
        concat!("Alignment of ", stringify!(ClOsalMutex))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClOsalMutex),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shared_lock) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ClOsalMutex),
            "::",
            stringify!(shared_lock)
        )
    );
}
pub type ClOsalMutexT = ClOsalMutex;
pub type ClOsalMutexAttrT = pthread_mutexattr_t;
pub type ClOsalCondAttrT = pthread_condattr_t;
pub const ClOsalSharedType_CL_OSAL_PROCESS_PRIVATE: ClOsalSharedType = 0;
pub const ClOsalSharedType_CL_OSAL_PROCESS_SHARED: ClOsalSharedType = 1;
pub type ClOsalSharedType = ::std::os::raw::c_uint;
pub use self::ClOsalSharedType as ClOsalSharedTypeT;
#[doc = "  The thread condition type wrapped"]
pub type ClOsalCondT = pthread_cond_t;
#[doc = " The type of an identifier to the OSAL Task ID."]
pub type ClOsalTaskIdT = ClUint64T;
pub type ClOsalMutexIdT = *mut ClOsalMutexT;
pub type ClOsalCondIdT = *mut ClOsalCondT;
pub type ClOsalSemIdT = ClHandleT;
#[doc = " The type of an identifier to the OSAL Shared Memory ID."]
pub type ClOsalShmIdT = ClUint32T;
#[doc = " The type of an identifier to the OSAL Process ID."]
pub type ClOsalPidT = ClUint32T;
#[doc = " The type of an identifier to the OSAL Task Data type."]
pub type ClOsalTaskDataT = ClPtrT;
pub type ClNanoTimeT = timespec;
#[doc = " CAllback\ntype of callback function invoked when a process is created."]
pub type ClOsalProcessFuncT =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
#[doc = " CAllback\ntype of callback function invoked when the task specific private key is destruyed."]
pub type ClOsalTaskKeyDeleteCallBackT =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
#[doc = " Default scheduling mechanism"]
pub const ClOsalSchedulePolicyT_CL_OSAL_SCHED_OTHER: ClOsalSchedulePolicyT = 0;
#[doc = " First-in-first-out"]
pub const ClOsalSchedulePolicyT_CL_OSAL_SCHED_FIFO: ClOsalSchedulePolicyT = 1;
#[doc = " Roundrobin"]
pub const ClOsalSchedulePolicyT_CL_OSAL_SCHED_RR: ClOsalSchedulePolicyT = 2;
#[doc = " The following enumeration type contains schedule policy of the tasks that will be created.\n The values of the ClOsalSchedulePolicyT enumeration type have the following interpretation:\n other is the default scheduling policy\n fifo & rr are used for real time threads (you must be running with superuser priviledges)."]
pub type ClOsalSchedulePolicyT = ::std::os::raw::c_uint;
#[doc = " When the scheduling is CL_OSAL_SCHED_OTHER, priority is not used"]
pub const ClOsalThreadPriorityT_CL_OSAL_THREAD_PRI_NOT_APPLICABLE: ClOsalThreadPriorityT = 0;
#[doc = " Highest thread priority."]
pub const ClOsalThreadPriorityT_CL_OSAL_THREAD_PRI_HIGH: ClOsalThreadPriorityT = 160;
#[doc = " Medium thread priority."]
pub const ClOsalThreadPriorityT_CL_OSAL_THREAD_PRI_MEDIUM: ClOsalThreadPriorityT = 80;
#[doc = " Lowest thread priority."]
pub const ClOsalThreadPriorityT_CL_OSAL_THREAD_PRI_LOW: ClOsalThreadPriorityT = 1;
#[doc = " The following enumeration type contains the various thread priorities.\n The values of the ClOsalProcessFlagT enumeration type have the following interpretation:"]
pub type ClOsalThreadPriorityT = ::std::os::raw::c_uint;
#[doc = " This will create a process with new session."]
pub const ClOsalProcessFlagT_CL_OSAL_PROCESS_WITH_NEW_SESSION: ClOsalProcessFlagT = 1;
#[doc = " This would create a new process group."]
pub const ClOsalProcessFlagT_CL_OSAL_PROCESS_WITH_NEW_GROUP: ClOsalProcessFlagT = 2;
#[doc = "  Process creation flags.\n  The values of the ClOsalProcessFlagT enumeration type have the following interpretation:\n"]
pub type ClOsalProcessFlagT = ::std::os::raw::c_uint;
#[doc = " read-only by this user"]
pub const ClOsalShmSecurityModeFlagT_CL_OSAL_SHM_MODE_READ_USER: ClOsalShmSecurityModeFlagT = 256;
#[doc = " read-only by the group"]
pub const ClOsalShmSecurityModeFlagT_CL_OSAL_SHM_MODE_READ_GROUP: ClOsalShmSecurityModeFlagT = 32;
#[doc = " read-only by everyone"]
pub const ClOsalShmSecurityModeFlagT_CL_OSAL_SHM_MODE_READ_OTHERS: ClOsalShmSecurityModeFlagT = 4;
#[doc = " read/write by this user"]
pub const ClOsalShmSecurityModeFlagT_CL_OSAL_SHM_MODE_WRITE_USER: ClOsalShmSecurityModeFlagT = 128;
#[doc = " read/write by the group"]
pub const ClOsalShmSecurityModeFlagT_CL_OSAL_SHM_MODE_WRITE_GROUP: ClOsalShmSecurityModeFlagT = 16;
#[doc = " read/write by everyone"]
pub const ClOsalShmSecurityModeFlagT_CL_OSAL_SHM_MODE_WRITE_OTHERS: ClOsalShmSecurityModeFlagT = 2;
#[doc = " Shared memory security options"]
pub type ClOsalShmSecurityModeFlagT = ::std::os::raw::c_uint;
#[repr(C)]
pub struct ClOsalShmAreaDefT {
    #[doc = " Place to store the component Exception information."]
    pub exceptionInfo: [ClCharT; 2048usize],
}
#[test]
fn bindgen_test_layout_ClOsalShmAreaDefT() {
    const UNINIT: ::std::mem::MaybeUninit<ClOsalShmAreaDefT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ClOsalShmAreaDefT>(),
        2048usize,
        concat!("Size of: ", stringify!(ClOsalShmAreaDefT))
    );
    assert_eq!(
        ::std::mem::align_of::<ClOsalShmAreaDefT>(),
        1usize,
        concat!("Alignment of ", stringify!(ClOsalShmAreaDefT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).exceptionInfo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ClOsalShmAreaDefT),
            "::",
            stringify!(exceptionInfo)
        )
    );
}
extern "C" {
    #[doc = " Shared memory associated with the component."]
    pub static mut gpClShmArea: *mut ClOsalShmAreaDefT;
}
extern "C" {
    #[doc = " Shared memory ID associated with the component."]
    pub static mut gClCompUniqueShmId: ClOsalShmIdT;
}
extern "C" {
    #[doc = "  \\brief Initializes the Operating System Abstraction Layer (OSAL).\n\n  \\par Header File:\n  clOsalApi.h\n\n  \\par Library File:\n  libClOsal\n\n  \\retval CL_RC_OK This API executed successfully.\n  \\retval CL_ERR_NO_MEM On memory allocation failure.\n  \\retval CL_ERR_MUTEX_CREATE On failure in creating a mutex.\n\n  \\par Description:\n  This API is used to initialize the OSAL. This should be the first\n  API to be called before any of the other OSAL APIs are invoked.\n\n  \\sa clOsalFinalize()\n"]
    pub fn clOsalInitialize(pConfig: ClPtrT) -> ClRcT;
}
